# include <stdio.h>
#include "stm32f10x.h"
#include "delay.h"
#include "usart.h"
#include "pwm.h"
#include "adc1.h"
#include "moto.h"
#include "gpio.h"

/**************************************************************************
作者：平衡小车之家
我的淘宝小店：http://shop114407458.taobao.com/
**************************************************************************/
//------------接线说明---------------
//BTN4模块    -----------   STM32F1主板1引脚

//    5V      -----------    5V
//    GND     -----------    GND
//    EN      -----------    PB6
//    A1      -----------    PB8
//    A2      -----------    PB9
//    B1      -----------    PA0
//    B2      -----------    PA1
//    C1      -----------    PA2
//    C2      -----------    PA3
//    D1      -----------    PA6
//    D2      -----------    PA7
//    AD      -----------    PB0

//------------接线说明---------------

//    BTN4模块  ----------  电机A
//    AOUT1   ------------  电机线电源+
//    AOUT2   ------------  电机线电源-

//    BTN4模块  ----------  电机B
//    BOUT1   ------------  电机线电源+
//    BOUT2   ------------  电机线电源-

//    BTN4模块  ----------  电机C
//    COUT1   ------------  电机线电源+
//    COUT2   ------------  电机线电源-

//    BTN4模块  ----------  电机D
//    DOUT1   ------------  电机线电源+
//    DOUT2   ------------  电机线电源-

int main(void)
{
    u16 adcx;
    float vcc;
    SystemInit();				      //======配置系统时钟为72M
    delay_init();                     //======初始化延时函数
    uart_init(9600);		          //======串口初始化
    Gpio_Init();					  //======GPIO初始化
    pwm_int_TIM2(7199,0);     		  //======初始化pwm输出 72000 000 /7199+1=10000
    pwm_int_TIM3(7199,0);     		  //======初始化pwm输出 72000 000 /7199+1=10000
    pwm_int_TIM4(7199,0);     		  //======初始化pwm输出 72000 000 /7199+1=10000
    adc1_Init();									  //======ADC1的初始化
    while(1)
    {
        control(1,7000,10);                //A电机正转  1=motoA PWM1 PWM2
//        control(2,10,7000);                //B电机反转  2=motoB PWM1 PWM2
//        control(3,10,7000);                //C电机反转  3=motoC PWM1 PWM2
//        control(4,10,7000);                //D电机反转  4=motoD PWM1 PWM2

        adcx=Get_adc1_Average(ADC_Channel_8,10);  //ACD通道8 求10次adc平均值
//	 printf("ADC的值=%d \r\n",adcx);      			//打印adc的值
        vcc=(float)adcx*(3.3*11/4096);     				//求当前电压
        printf("当前电压=%6.2f V \r\n",vcc);				//打印当前电压
    }
}




